[
    "A day on Venus is longer than its year! It takes 243 Earth days to rotate once.",
    "Neutron stars can spin at 600 rotations per second!",
    "One teaspoon of a neutron star would weigh 6 billion tons!",
    "The Sun accounts for 99.86% of the mass in our solar system.",
    "There are more stars in the universe than grains of sand on Earth!",
    "Saturn's rings are only about 30 feet thick!",
    "A year on Mercury is just 88 Earth days long.",
    "The footprints on the Moon will be there for 100 million years.",
    "The International Space Station orbits Earth every 90 minutes!",
    "Jupiter's Great Red Spot is a storm that's been raging for over 300 years!",
    "The coldest place in the universe is the Boomerang Nebula at -272°C!",
    "There's a planet made entirely of diamonds called 55 Cancri e.",
    "The Milky Way galaxy is on a collision course with Andromeda in 4 billion years.",
    "You can fit all the planets in our solar system between Earth and the Moon!",
    "The Sun loses 4 million tons of mass every second due to nuclear fusion.",
    "Space is completely silent because there's no atmosphere to carry sound.",
    "A full NASA spacesuit costs about $12 million dollars!",
    "The largest known star, UY Scuti, could fit 5 billion Suns inside it!",
    "On Mars, the sunset appears blue instead of red/orange.",
    "There are more than 100 billion galaxies in the observable universe.",
    "The hottest planet in our solar system is Venus, not Mercury!",
    "Astronauts grow about 2 inches taller in space due to lack of gravity.",
    "One million Earths could fit inside the Sun!",
    "The Moon is moving away from Earth at about 3.8 cm per year.",
    "A year on Pluto is 248 Earth years long!",
    "The Great Wall of China is NOT visible from space with the naked eye.",
    "There's a water reservoir in space that holds 140 trillion times the water in Earth's oceans!",
    "Venus rotates backwards compared to most planets in our solar system.",
    "The temperature in space can range from -270°C to millions of degrees!",
    "Halley's Comet won't be visible from Earth again until 2061.",
    "There are volcanoes on Mars that are larger than Mount Everest!",
    "The center of the Milky Way smells like rum and tastes like raspberries!",
    "It takes light from the Sun 8 minutes and 20 seconds to reach Earth.",
    "There's a planet where it rains glass sideways - HD 189733b!",
    "Black holes aren't actually holes - they're incredibly dense objects!",
    "Saturn could float in water because it's less dense!",
    "The largest volcano in our solar system is on Mars - Olympus Mons!",
    "Uranus rotates on its side, likely from a massive ancient collision.",
    "There are more trees on Earth than stars in the Milky Way!",
    "The Parker Solar Probe is the fastest human-made object at 430,000 mph!",
    "Europa, Jupiter's moon, may have twice as much water as Earth!",
    "A spacesuit takes 45 minutes to put on properly.",
    "The longest a person has lived in space continuously is 437 days!",
    "There's a massive canyon on Mars that's 10 times longer than the Grand Canyon.",
    "The atmosphere on Venus is so thick it would crush you instantly!",
    "Astronauts can't burp in space - there's no gravity to separate gas from liquid!",
    "The International Space Station travels at 17,500 mph!",
    "Mars has the largest dust storms in the solar system - lasting for months!",
    "The universe is expanding faster than the speed of light!",
    "There's enough gold in Earth's core to coat the entire surface 1.5 feet deep!",
    "Io, a moon of Jupiter, is the most volcanically active body in the solar system.",
    "A year on Neptune is 165 Earth years!",
    "The Andromeda Galaxy is heading towards us at 250,000 mph!",
    "Space smells like burnt steak and hot metal according to astronauts!",
    "Titan, Saturn's moon, has liquid methane lakes and rivers!",
    "The coldest temperature ever recorded in space was in the Boomerang Nebula.",
    "Galaxies can collide and merge over millions of years.",
    "The first meal eaten in space was applesauce!",
    "There are rogue planets floating in space not orbiting any star.",
    "The asteroid belt between Mars and Jupiter contains millions of asteroids!",
    "Ganymede, Jupiter's largest moon, is bigger than Mercury!",
    "White dwarfs are so dense that a teaspoon would weigh as much as an elephant!",
    "The farthest human-made object is Voyager 1, over 14 billion miles away!",
    "Mars' Valles Marineris canyon is 4 times deeper than the Grand Canyon!",
    "There are storms on Jupiter that are larger than Earth!",
    "The Moon has moonquakes, just like Earth has earthquakes.",
    "Comets are often called 'dirty snowballs' because they're made of ice and dust.",
    "The Oort Cloud surrounds our solar system with trillions of icy objects!",
    "Neptune's winds can reach speeds of 1,200 mph - the fastest in the solar system!",
    "The Sun will eventually become a red giant and engulf Mercury, Venus, and possibly Earth.",
    "Pluto was discovered in 1930 and demoted from planet status in 2006.",
    "Saturn's moon Enceladus shoots geysers of water into space!",
    "The Kuiper Belt is home to thousands of icy worlds beyond Neptune.",
    "Mars has a day length very similar to Earth - about 24 hours and 37 minutes!",
    "The first animal in space was a dog named Laika in 1957.",
    "Jupiter protects Earth by deflecting many asteroids with its massive gravity!",
    "The speed of light is 186,282 miles per second!",
    "Astronauts lose bone density in space at a rate of 1% per month.",
    "The Hubble Space Telescope has taken over 1.5 million observations!",
    "Betelgeuse could explode into a supernova at any time - and it might already have!",
    "The North Star (Polaris) won't always be the North Star due to Earth's wobble.",
    "Mars appears red because its surface is covered in iron oxide (rust)!",
    "The largest known structure in the universe is the Hercules-Corona Borealis Great Wall.",
    "Space radiation would give you a lethal dose without a spacesuit in minutes!",
    "The Sun is 4.6 billion years old and halfway through its life!",
    "There are brown dwarfs - objects too big to be planets but too small to be stars.",
    "Olympus Mons on Mars is 16 miles high - 3 times taller than Mount Everest!",
    "The universe is estimated to be 13.8 billion years old.",
    "Pulsars are rapidly spinning neutron stars that emit beams of radiation.",
    "The first spacewalk was performed by Soviet cosmonaut Alexei Leonov in 1965.",
    "Jupiter's moon Callisto is one of the most heavily cratered objects in the solar system!",
    "Some exoplanets orbit their stars in just a few hours!",
    "The Drake Equation estimates how many alien civilizations might exist.",
    "Red giants can be 100 times larger than the Sun!",
    "The Wow! Signal from 1977 remains one of the strongest candidate signals for alien life.",
    "Astronauts see 16 sunrises and sunsets every day on the ISS!",
    "The planet HD 189733b has winds of 5,400 mph and rains molten glass!",
    "Meteor showers happen when Earth passes through debris left by comets.",
    "The Voyager Golden Records contain sounds and images representing Earth."
]